OpenNuvoton/M55M1BSP/SampleCode/ISP/common/ISP_system_M55M1.c
    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I3C0_Msk)
        NVIC_ITNS_CONF(I3C0_IRQn);

    if (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UTCPD_Msk)
        NVIC_ITNS_CONF(UTCPD_IRQn);

    /* SCU_D2PNS0 */
    if (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_LPPDMA_Msk)
        NVIC_ITNS_CONF(LPPDMA_IRQn);

    if (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_CCAP_Msk)
        NVIC_ITNS_CONF(CCAP_IRQn);

    /* SCU_D2PNS2 */
    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPTMR01_Msk)
    {
        NVIC_ITNS_CONF(LPTMR0_IRQn);
        NVIC_ITNS_CONF(LPTMR1_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_TTMR01_Msk)
    {
        NVIC_ITNS_CONF(TTMR0_IRQn);
        NVIC_ITNS_CONF(TTMR1_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPADC0_Msk)
        NVIC_ITNS_CONF(LPADC0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPI2C0_Msk)
        NVIC_ITNS_CONF(LPI2C0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPSPI0_Msk)
        NVIC_ITNS_CONF(LPSPI0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_DMIC0_Msk)
    {
        NVIC_ITNS_CONF(DMIC0_IRQn);
        NVIC_ITNS_CONF(DMIC0VAD_IRQn);
    }

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPUART0_Msk)
        NVIC_ITNS_CONF(LPUART0_IRQn);

    if (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_AWF_Msk)
        NVIC_ITNS_CONF(AWF_IRQn);

    /* Set interrupt to Non-secure according to SCU_INIT_IO_ITNS_VAL settings */
    if (SCU_INIT_IO_ITNS_VAL & BIT0) NVIC_ITNS_CONF(GPA_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT1) NVIC_ITNS_CONF(GPB_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT2) NVIC_ITNS_CONF(GPC_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT3) NVIC_ITNS_CONF(GPD_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT4) NVIC_ITNS_CONF(GPE_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT5) NVIC_ITNS_CONF(GPF_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT6) NVIC_ITNS_CONF(GPG_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT7) NVIC_ITNS_CONF(GPH_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT8) NVIC_ITNS_CONF(GPI_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT9) NVIC_ITNS_CONF(GPJ_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT10) NVIC_ITNS_CONF(EINT0_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT11) NVIC_ITNS_CONF(EINT1_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT12) NVIC_ITNS_CONF(EINT2_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT13) NVIC_ITNS_CONF(EINT3_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT14) NVIC_ITNS_CONF(EINT4_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT15) NVIC_ITNS_CONF(EINT5_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT16) NVIC_ITNS_CONF(EINT6_IRQn);

    if (SCU_INIT_IO_ITNS_VAL & BIT17) NVIC_ITNS_CONF(EINT7_IRQn);

    /* Enable SCU Int status */
    SCU->SVIEN0 = (uint32_t)(-1);
    SCU->SVIEN1 = (uint32_t)(-1);
    NVIC_EnableIRQ(SCU_IRQn);
}

NVT_ITCM __WEAK void SCU_IRQHandler(void)
{

}

/**
 * @brief   Setup a Nonsecure callable Region
 *
 * @details The base and limit of Nonsecure callable region is dependent on the
 *          application code size.
 */
void NSC_Init(uint32_t u32RegionIdx)
{
    uint32_t u32Base = 0,
             u32Limit = 0;

#if defined (__ICCARM__)
# pragma section = "NSC"
    u32Base  = (uint32_t)__section_begin("NSC");
    u32Limit = (uint32_t)__section_end("NSC");
#elif defined(__ARMCC_VERSION)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wdollar-in-identifier-extension"
    extern uint32_t Image$$NSC_ROM$$XO$$Base [];
    extern uint32_t Image$$NSC_ROM$$XO$$Limit[];
    u32Base  = (uint32_t)Image$$NSC_ROM$$XO$$Base;
    u32Limit = (uint32_t)Image$$NSC_ROM$$XO$$Limit;
#pragma clang diagnostic pop
#else
    extern uint32_t __start_NSC[];
    extern uint32_t __end_NSC[];
    u32Base  = (uint32_t)__start_NSC;
    u32Limit = (uint32_t)__end_NSC;
#endif

    if (u32Limit > 0)
    {
        SAU->RNR  = (u32RegionIdx & SAU_RNR_REGION_Msk);
        SAU->RBAR = (u32Base & SAU_RBAR_BADDR_Msk);
        SAU->RLAR = (u32Limit & SAU_RLAR_LADDR_Msk) |
                    (SAU_RLAR_NSC_Msk | 1ul);
    }
}

/**
 * @brief   Setup a SAU Region
 *
 * @details Writes the region information contained in SAU_Region to the
 *          registers SAU_RNR, SAU_RBAR, and SAU_RLAR
 */
void TZ_SAU_Setup(void)
{
#if defined (__SAUREGION_PRESENT) && (__SAUREGION_PRESENT == 1U)

#if defined (SAU_INIT_REGION0) && (SAU_INIT_REGION0 == 1U)
    SAU_INIT_REGION(0);
#endif

#if defined (SAU_INIT_REGION1) && (SAU_INIT_REGION1 == 1U)
    SAU_INIT_REGION(1);
#endif

#if defined (SAU_INIT_REGION2) && (SAU_INIT_REGION2 == 1U)
    SAU_INIT_REGION(2);
#endif

#if defined (SAU_INIT_REGION3) && (SAU_INIT_REGION3 == 1U)
    SAU_INIT_REGION(3);
#endif

#if defined (SAU_INIT_REGION4) && (SAU_INIT_REGION4 == 1U)
    SAU_INIT_REGION(4);
#endif

#if defined (SAU_INIT_REGION5) && (SAU_INIT_REGION5 == 1U)
    SAU_INIT_REGION(5);
#endif

#if defined (SAU_INIT_REGION6) && (SAU_INIT_REGION6 == 1U)
    SAU_INIT_REGION(6);
#endif

#if defined (SAU_INIT_REGION7) && (SAU_INIT_REGION7 == 1U)
    SAU_INIT_REGION(7);
#endif
#endif /* defined (__SAUREGION_PRESENT) && (__SAUREGION_PRESENT == 1U) */

#if defined (SAU_INIT_CTRL) && (SAU_INIT_CTRL == 1U)
    SAU->CTRL = ((SAU_INIT_CTRL_ENABLE << SAU_CTRL_ENABLE_Pos) & SAU_CTRL_ENABLE_Msk) |
                ((SAU_INIT_CTRL_ALLNS  << SAU_CTRL_ALLNS_Pos)  & SAU_CTRL_ALLNS_Msk)   ;
#endif

#if defined (SCB_CSR_AIRCR_INIT) && (SCB_CSR_AIRCR_INIT == 1U)
    SCB->SCR   = (SCB->SCR   & ~(SCB_SCR_SLEEPDEEPS_Msk)) |
                 ((SCB_CSR_DEEPSLEEPS_VAL     << SCB_SCR_SLEEPDEEPS_Pos)     & SCB_SCR_SLEEPDEEPS_Msk);

    SCB->AIRCR = (0x05FA << SCB_AIRCR_VECTKEY_Pos) |
                 ((SCB_AIRCR_SYSRESETREQS_VAL << SCB_AIRCR_SYSRESETREQS_Pos) & SCB_AIRCR_SYSRESETREQS_Msk) |
                 ((SCB_AIRCR_BFHFNMINS_VAL    << SCB_AIRCR_BFHFNMINS_Pos)    & SCB_AIRCR_BFHFNMINS_Msk)    |
                 ((SCB_AIRCR_PRIS_VAL         << SCB_AIRCR_PRIS_Pos)         & SCB_AIRCR_PRIS_Msk);

#endif /* defined (SCB_CSR_AIRCR_INIT) && (SCB_CSR_AIRCR_INIT == 1U) */

#if (((defined (__FPU_USED) && (__FPU_USED == 1U))              || \
      (defined (__ARM_FEATURE_MVE) && (__ARM_FEATURE_MVE > 0))) && \
      (defined (TZ_FPU_NS_USAGE) && (TZ_FPU_NS_USAGE == 1U)))

    SCB->NSACR = (SCB->NSACR & ~(SCB_NSACR_CP10_Msk | SCB_NSACR_CP11_Msk)) |
                 ((SCB_NSACR_CP10_11_VAL << SCB_NSACR_CP10_Pos) & (SCB_NSACR_CP10_Msk | SCB_NSACR_CP11_Msk));

    FPU->FPCCR = (FPU->FPCCR & ~(FPU_FPCCR_TS_Msk | FPU_FPCCR_CLRONRETS_Msk | FPU_FPCCR_CLRONRET_Msk)) |
                 ((FPU_FPCCR_TS_VAL        << FPU_FPCCR_TS_Pos) & FPU_FPCCR_TS_Msk) |
                 ((FPU_FPCCR_CLRONRETS_VAL << FPU_FPCCR_CLRONRETS_Pos) & FPU_FPCCR_CLRONRETS_Msk) |
                 ((FPU_FPCCR_CLRONRET_VAL  << FPU_FPCCR_CLRONRET_Pos) & FPU_FPCCR_CLRONRET_Msk);
#endif

#if defined (SCB_ICSR_INIT) && (SCB_ICSR_INIT == 1U)
    SCB->ICSR  = (SCB->ICSR  & ~(SCB_ICSR_STTNS_Msk)) |
                 ((SCB_ICSR_STTNS_VAL         << SCB_ICSR_STTNS_Pos)         & SCB_ICSR_STTNS_Msk);
#endif /* defined (SCB_ICSR_INIT) && (SCB_ICSR_INIT == 1U) */

    /* Repeat this for all possible ITNS elements */

    /* Initial NonSecure Callable region */
    NSC_Init(4);    /* SAU region 4 is dedicated for NSC */
}

#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
